---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CouplerCoupledEngagement
source: html/73ec79a7-417e-4086-15ef-c3ea7613bb7b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CouplerCoupledEngagement Property

"Bar Engagement 2"

## Syntax (C#)
```csharp
public static ForgeTypeId CouplerCoupledEngagement { get; }
```